<template>
  <section class="article">
    <div class="container">
      <div class="article__inner">
        <back-btn link="/articles" />
        <h3 class="title">{{ article.title }}</h3>
        <span class="date"> {{ article.created }} </span>
        <div class="article__wrap">
          <div class="article__item">
            <img src="../../assets/images/articles-1.jpg" alt="" />
            <p>
              По сравнению с 2021 годом, в 2022 году продажи недвижимости в
              Турции вырастут на 21,7%. По сравнению с европейскими странами
              цены на жилье в Турции выросли в десять раз. Эти горячие рыночные
              показатели, наблюдавшиеся в 2022 году, были зафиксированы как
              самый высокий рост за последние 12 лет. Хотя продажи домов
              увеличиваются в каждом городе Турции, четыре города выделяются как
              самые горячие рынки жилья.
            </p>
            <p>
              <b> Стамбул </b>
              Продажи недвижимости в Стамбуле выросли на 11,5% по сравнению с
              предыдущим годом. По данным TUIK, в 2021 году 63,8% продаж
              недвижимости в Стамбуле пришлось на европейскую сторону и 36,2% на
              анатолийскую. Растущие ценные районы города были зарегистрированы
              как Эсеньюрт, Бейликдюзю и Умрание. В то время, как многие
              жилищные проекты сосредоточены в этих районах, также важно, чтобы
              рабочие зоны и бизнес-центры были сосредоточены в этих районах.
            </p>
            <p>
              <b> Анталия </b>
              Летом 2022 года провинцией с самыми высокими продажами
              недвижимости было зафиксировано в Анталье. Поскольку это самый
              популярный город летнего сезона и его популярность с точки зрения
              надежности, объемы продаж недвижимости также увеличились. Аланья,
              Муратпаша и Коньяалты являются одними из самых популярных районов
              Анталии. Тот факт, что они рассматриваются как деловые центры и
              туристические места, сделал эти районы популярным рынком сбыта.
            </p>
            <p>
              <b>Измир</b>
              Не будет ошибкой сказать, что Измир занимает четвертое место в
              списке самых популярных рынков недвижимости. Измир, который всегда
              был на рынке жилья с его многочисленными историческими
              достопримечательностями и туристическими зонами, также стал
              фаворитом инвесторов. Буджа, где расположен престижный
              университет, является одним из самых популярных районов Измира, а
              Каршияка с элитной атмосферой следует за Буджей.
            </p>
          </div>
          <div class="articles__similar">
            <p class="title">Похожие статьи</p>
            <div
              class="articles__card"
              @click="redirect(item.id)"
              v-for="(item, i) in articlesSimilar"
              :key="i"
            >
              <div class="articles__card-img">
                <img
                  v-if="item.img"
                  :src="require(`../../assets/images/${item.img}`)"
                  alt=""
                />
              </div>
              <h3 v-if="item.title">{{ item.title }}</h3>
              <p v-if="item.description">{{ item.description }}</p>
              <router-link :to="'/articles/' + item.id">
                Подробнее
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                >
                  <path
                    d="M4 12L20 12M20 12L14 6M20 12L14 18"
                    stroke="#7D4DE1"
                    stroke-width="1.5"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                  />
                </svg>
              </router-link>
            </div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import BackBtn from "@/components/global/BackBtn.vue";
import { ref } from "vue";
import { useRouter } from "vue-router";
export default {
  components: { BackBtn },
  setup() {
    const router = useRouter();

    const article = ref({
      id: 1,
      img: "articles-1.jpg",
      title: "Самые горячие рынки жилья в Турции",
      created: "24 октября, 2022",
    });

    const articlesSimilar = ref([
      {
        id: 1,
        img: "articles-1.jpg",
        title: "Самые горячие рынки жилья в Турции",
        description:
          "По сравнению с 2021 годом, в 2022 году продажи недвижимости в Турции вырастут на 21,7%. По сравнению с европейскими",
      },
      {
        id: 2,
        img: "articles-2.jpg",
        title: "ВНЖ в Турции за покупку недвижимоcти",
        description:
          "По сравнению с 2021 годом, в 2022 году продажи недвижимости в Турции вырастут на 21,7%. По сравнению с европейскими",
      },
      {
        id: 3,
        img: "articles-3.jpg",
        title: "Традиции, культура и обычаи Турции",
        description:
          "Турция — такая, какую мы знаем её сегодня — образовалась сравнительно недавно. В разные времена она находилась под власть",
      },
    ]);

    const redirect = (id) => {
      router.push({ path: "/articles/" + id });
    };

    return {
      router,
      article,
      articlesSimilar,
      redirect,
    };
  },
};
</script>

<style></style>
